{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "VisionEncoderDecoderModel",
    "parent_library": "transformers.models.vision_encoder_decoder.modeling_vision_encoder_decoder"
  },
  "base_model_name_or_path": "microsoft/trocr-base-printed",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "query",
    "value"
  ],
  "task_type": null
}